FinalProj/ParaviewTesting/4secSmaller/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       239361;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       239461;
    }
    wall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1234;
        startFace       239561;
    }
    wedge1
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          120340;
        startFace       240795;
    }
    wedge2
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          120340;
        startFace       361135;
    }
    axis
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       481475;
    }
)

// ************************************************************************* //
