FinalProj/ParaviewTesting/4secSmaller/system/blockMeshDict0.4
//Ben Juenger
//COE347 OF3

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1.0;

vertices
(
  (0.000000000000000 0.000000000000000 0.000000000000000) // 0
  (8.000000000000000 0.000000000000000 0.000000000000000) // 1
  (8.005000000000001 0.000000000000000 0.000000000000000) // 2
  (16.004999999999999 0.000000000000000 0.000000000000000) // 3
  (0.000000000000000 0.424854363114612 0.011125203030846) // 4
  (8.000000000000000 0.424854363114612 0.011125203030846) // 5
  (8.005000000000001 0.424854363114612 0.011125203030846) // 6
  (16.004999999999999 0.424854363114612 0.011125203030846) // 7
  (0.000000000000000 0.424854363114612 -0.011125203030846) // 8
  (8.000000000000000 0.424854363114612 -0.011125203030846) // 9
  (8.005000000000001 0.424854363114612 -0.011125203030846) // 10
  (16.004999999999999 0.424854363114612 -0.011125203030846) // 11
  (0.000000000000000 0.499828662487779 0.013088474153937) // 12
  (8.000000000000000 0.499828662487779 0.013088474153937) // 13
  (8.005000000000001 0.499828662487779 0.013088474153937) // 14
  (16.004999999999999 0.499828662487779 0.013088474153937) // 15
  (0.000000000000000 0.499828662487779 -0.013088474153937) // 16
  (8.000000000000000 0.499828662487779 -0.013088474153937) // 17
  (8.005000000000001 0.499828662487779 -0.013088474153937) // 18
  (16.004999999999999 0.499828662487779 -0.013088474153937) // 19
);

blocks
(
  hex (0 1 9 8 0 1 5 4)  (1600 85 1) simpleGrading (1.000000 1.000000 1.000000) // 0

  hex (1 2 10 9 1 2 6 5)  (1 85 1) simpleGrading (1.000000 1.000000 1.000000) // 1

  hex (2 3 11 10 2 3 7 6)  (1600 85 1) simpleGrading (1.000000 1.000000 1.000000) // 2

  hex (8 9 17 16 4 5 13 12)  (1600 100 1) simpleGrading (1.000000 1.000000 1.000000) // 4

  hex (10 11 19 18 6 7 15 14)  (1600 100 1) simpleGrading (1.000000 1.000000 1.000000) // 5

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 8 4 0)
            (8 16 12 4)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 7 11 3)
	    (11 7 15 19)
        );
    }
    wall
    {
      type wall;
      faces
      (
         (16 17 13 12)
	 (9 5 13 17)
	 (10 6 5 9)
	 (18 14 6 10)
	 (18 19 15 14)

      );
    }
    wedge1
     { 
           type wedge;
           faces  
           (
               (0 1 9 8)
	       (8 9 17 16)
	       (1 2 10 9)
	       (10 11 19 18)
	       (2 3 11 10)
           );
      }
      wedge2
     { 
           type wedge;
           faces  
           (
               (0 4 5 1)
	       (4 12 13 5)
	       (1 5 6 2)
	       (2 6 7 3)
	       (6 14 15 7)
      
           );
      }	

      axis
    {
        type empty;
        faces
        (
            (0 1 1 0)
            (1 2 2 1)
	    (2 3 3 2)
        );
    }
	

);

mergePatchPairs
(
);





	       
	       
	       	
	  
	       